Revit 2024 API
DockPosition Enumeration
 Which part of the Revit application frame the pane should dock to.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Since: 2014
Syntax
C#
public enum DockPosition
Visual Basic
Public Enumeration DockPosition
Visual C++
public enum class DockPosition
Members
Member name | Description
Top
Left
Right
Bottom
Floating
Tabbed
See Also
Autodesk.Revit.UI Namespace